Revit 2024 API
RenderNode Properties
The RenderNode type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NodeName
 A readable name of the output node.
See Also
RenderNode Class
Autodesk.Revit.DB Namespace